/* eslint-disable max-len */
import './Rights.scss';
export const Rights = () => (
  <div className="container">
    <div className="row">
      <div className="col-24">
        <h3 className="heading-2 margin-top-50 position__center">
          Угода користувача
        </h3>
        <p>
          Я (надалі – «Я» та/або «Користувач») погоджуюсь з умовами цієї Угоди
          користувача і, використовуючи сайт: NiceGadgets.com.ua (надалі –
          «Сайт») та/або інші сервіси (надалі разом іменуються як «Он-лайн»
          та/або «Он-лайн»), при замовленні, листуванні, телефонній розмові,
          залишенні відгуків тощо, надаю згоду на обробку і захист своїх
          персональних даних, як Користувача, в обсязі, порядку, відповідно до
          мети обробки згідно з Положенням про обробку персональних даних,
          розміщеному тут: (надалі – «Положення» та/або «Положення про обробку і
          захист персональних даних»).
        </p>

        <h3 className="heading-3 margin-top-50 position__center position__center">
          Персональні дані
        </h3>
        <p>
          Я також погоджуюсь з тим, що Володілець має право надавати доступ та
          передавати мої персональні дані третім особам без будь-яких додаткових
          повідомлень, не змінюючи при цьому мети їх обробки, визначеної в
          Положенні та цій Угоді. В тому числі, на перевірку зазначеної Мною
          інформації та не заперечую про передачу для можливого необхідного
          з&apos;ясування даної інформації третім особам, під якими розумію:
          фінансові установи, колекторські компанії, оператори мобільного та
          поштового зв’язку, інші фізичні та/або юридичні особи.
        </p>
        <br />
        <p>
          Надаю згоду запитувати та отримувати в бюро кредитних історій,
          включених до Єдиного реєстру бюро кредитних історій (надалі – «Бюро»),
          дані та інформацію у вигляді зведених показників, сформованих на
          основі інформації, що міститься у моїй кредитній історії та/або на
          основі інформації доступної з відкритих джерел, від третіх осіб, з
          використанням доступних Бюро моделей розрахунку, а також на
          використання зазначеної інформації володільцем та/або третіми особами
          для визначення та пропонування мені Володільцем в особистому кабінеті
          на Он-лайн платформі NiceGadgets маркетингових/спеціальних
          пропозицій(фінансових лімітів) для придбання товарів та/або послуг.
        </p>
        <br />
        <p>
          Ми цінуємо ваше право на особисте життя та нерозголошення вашої
          персональної інформації. Ця Угода користувача — правило, яким
          користуються всі співробітники нашого сервісу, та регламентує збір і
          використання особистої інформації, яка може бути запитана/отримана при
          відвідуванні Он-лайн платформи NiceGadgets: при використанні сервісу,
          при замовленні, листуванні, телефонній розмові, будь-якої іншої
          комунікації, при якій здійснюється обмін даними/інформацією. Якщо у
          вас виникнуть питання або проблеми у зв’язку з конфіденційністю,
          надсилайте, будь ласка, свої питання або зауваження на електронну
          адресу: NiceGadgets.com.ua
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Яку інформацію ми збираємо
        </h3>
        <p>
          На Он-лайн платформі NiceGadgets, в разі, коли ви робите замовлення,
          берете участь в акції, дослідженнях або іншим чином взаємодієте з
          нами, ми збираємо як особисту інформацію, так і загальні дані.
        </p>
        <br />
        <p>
          Особиста інформація стосується окремого користувача та обробляється в
          порядку, межах, з метою, визначених в Положенні. Ми не вимагаємо
          реєстрації або надання такої інформації для перегляду нашої Он-лайн
          платформи та отримання доступу до його змісту.
        </p>
        <br />
        <p>
          Для того щоб зробити замовлення товарів/послуг, брати участь у акціях,
          дослідженнях або іншим чином взаємодіяти з нами, ви повинні уважно
          ознайомитися з вашими правами та обов’язками щодо обробки персональних
          даних, які зазначені в ст. 8 Законі України «Про захист персональних
          даних» та Положенні, уважно ознайомитися з даною Угодою користувача та
          Положенням, а також висловити свою повну згоду з їх умовами.
        </p>
        <br />
        <p>
          Якщо ви не погоджуєтеся з будь-якою з умов даної Угоди користувача та
          Положення про обробку і захист персональних даних, будь ласка, не
          надавайте особисту інформацію (персональні дані).
        </p>
        <br />
        <p>
          Згоду на використання вашої особистої інформації ви можете відкликати
          в будь-який момент. Для цього достатньо надіслати повідомлення
          електронною поштою, з поміткою в темі листа «Персональні дані», за
          адресою: NiceGadgets.com.ua
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Чому ми обробляємо персональні дані
        </h3>
        <p>
          Термін «персональні дані» використовується в значенні, визначеному в
          Законі України «Про захист персональних даних» та становить сукупність
          відомостей про користуваня, які визначаються в Положенні .
        </p>
        <br />
        <p>
          Ми можемо обробляти ваші персональні дані для цілей та з метою,
          визначених в Положенні. При цьому одночасно можуть застосовуватися
          одна або кілька цілей.
        </p>
        <br />
        <p>
          Ми діємо відповідно до цієї Угоди користувача, на підставі Положення
          про обробку і захист персональних даних та на підставі чинного
          законодавства України. Ми маємо право зберігати Персональні дані
          стільки, скільки необхідно для реалізації мети, що зазначена у даній
          Угоді користувача та Положенні.
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Як збираємо інформацію
        </h3>
        <p>
          Мета, цілі обробки персональних даних, а також інші умови щодо обробки
          персональних даних визначаються в Положенні.
        </p>
        <br />
        <p>
          Особиста інформація, як ми зазначили вище, надходить безпосередньо від
          вас, та з вашого відома. Так, коли ви реєструєтеся на Он-лайн
          платформі, ми отримуємо надану вами інформацію. Коли ви реєструєтеся в
          промо-акції, ми збираємо інформацію, необхідну для вашої участі, аби
          виконати наші зобов’язання перед вами. Коли ви здійснюєте замовлення
          товару, ми збираємо вказану вами інформацію, щоб мати змогу оформити
          замовлення та доставити його вам. Коли ви надсилаєте нам електронного
          листа, ми зберігаємо вказану вами адресу електронної пошти, щоб мати
          змогу відповісти, тощо.
        </p>
        <br />
        <p>
          Також ми постійно збираємо загальну інформацію, коли ви заходите на
          нашу Он-лайн платформу. Процес збору таких даних відбувається з
          допомогою технологій cookies, як пояснюється нижче.
        </p>

        <h3 className="heading-3 margin-top-50 position__center">Cookies</h3>
        <p>
          Як і багато інших компаній, ми використовуємо технологію cookies на
          нашій Он-лайн платформі та поза її межами. Cookies — це уривки
          інформації, які Он-лайн платформа передає на жорсткий диск споживача
          (Користувача) для зберігання інформації, пов’язаної з Он-лайн
          платформою. Ця технологія розширює ваші можливості використання
          інтернету, зберігаючи ваші пріоритети під час перегляду певного сайту.
          Технологія cookies не містить особистої інформації і не може жодним
          чином налаштовувати вашу систему або зчитувати інформацію з вашого
          жорсткого диска.
        </p>
        <br />
        <p>
          Під час перегляду нашої Он-лайн платформи ми можемо розмістити cookies
          на вашому комп’ютері. Такі тимчасові cookies використовують для
          підрахунку кількості візитів на нашу Он-лайн платформу. Вони
          видаляються, коли ви виходите з браузера. Постійні cookies можуть
          зберігатися на вашому комп’ютері вашим браузером. Під час реєстрації
          цей тип cookies повідомляє: вперше ви до нас завітали чи заходили на
          нашу Он-лайн платформу раніше. Cookie не містять Персональних даних і
          можуть бути заблоковані вами у будь-який момент. Сookies не отримують
          особистої інформації про вас та не надають нам вашої контактної
          інформації, а також не отримують жодної інформації з вашого
          комп’ютера. Ми використовуємо cookies для визначення характеристик
          Он-лайн платформи та пропозицій, які вам найбільше подобаються з метою
          надання вам більше інформації, в якій ви зацікавлені. Крім того, файли
          cookie використовуються, щоб зробити Он-лайн платформу NiceGadgets
          безпечною, захищеною і зручною. Файли cookie забезпечують підтримку
          функцій безпеки та їх запуск. Файли cookie також дозволяють
          відстежувати порушення Угоди користувача відвідувачами або пристроями.
          Файли cookie допомагають оцінити кількість і частоту запитів, а також
          виявляти і блокувати тих відвідувачів або пристрої, які намагаються
          виконати пакетні завантаження інформації з Он-лайн платформи.
        </p>
        <br />
        <p>
          Ці модулі можуть бути кнопками синхронізації аккаунту на Он-лайн
          платформі NiceGadgets, Like, ретвітнути або відповідно «Мені
          подобається». Якщо відвідувач відкривав одну з веб-сторінок, оснащену
          таким плагіном, його інтернет-браузер безпосередньо підключить його до
          серверів Facebook, Twitter, LinkedIn, Youtube Telegram, Instagram,
          Viber. Плагін буде передавати на сервер дані про те, які саме
          веб-сторінки Он-лайн платформи NiceGadgets відвідувач переглядав. При
          використанні будь-яких функцій плагіну, ця інформація також буде
          синхронізована з обліковим записом відвідувача на Facebook, Twitter,
          Youtube Telegram, Instagram, Viber. Більш детальну інформацію про збір
          і використання даних мережами Facebook, Twitter, Google+, Youtube
          Telegram, Instagram, Viber, а також про права і можливості щодо
          захисту персональних даних в даному контексті можна знайти в розділі
          про конфіденційність на сайтах Facebook, Twitter, LinkedIn, Youtube,
          Telegram, Instagram, Viber.
        </p>
        <br />
        <p>
          Ми цінуємо ваше право на особисте життя та нерозголошення вашої
          персональної інформації. Ця Угода користувача — правило, яким
          користуються всі співробітники нашого сервісу, та регламентує збір і
          використання особистої інформації, яка може бути запитана/отримана при
          відвідуванні Он-лайн платформи NiceGadgets: при використанні сервісу,
          при замовленні, листуванні, телефонній розмові, будь-якої іншої
          комунікації, при якій здійснюється обмін даними/інформацією. Якщо у
          вас виникнуть питання або проблеми у зв’язку з конфіденційністю,
          надсилайте, будь ласка, свої питання або зауваження на електронну
          адресу: NiceGadgets.com.ua
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Ціни та наявність товару
        </h3>
        <p>
          Опис товарів, що розміщений на Он-лайн платформі, в тому числі ціни
          позначені на Он-лайн платформі та інформація щодо наявності товарів,
          може змінюватись. Сума замовлення може змінюватись в залежності від
          ціни, кількості, номенклатури товару наявного у продавця на дату
          відвантаження. Остаточна вартість товару зазначається в розрахункових
          та/або товаросупровідних документах, що надаються покупцеві (або його
          представнику) під час отримання замовлення. У випадку відсутності
          товару продавець може в односторонньому порядку скасовувати
          замовлення.
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Треті сторони, що надають послуги
        </h3>
        <p>
          У процесі роботи ми звертаємося до інших компаній та осіб, які
          виконують багато функцій. Наприклад, виконання та доставку замовлень,
          надання підтримки споживачів, замовляємо в певних агенцій
          адміністрування промо-кампаній, аналіз даних. Ці агенції можуть мати
          доступ до особистої інформації, якщо це необхідно для виконання їхніх
          функцій, однак їм заборонено використовувати особисту інформацію з
          іншою метою, ніж та, яка зазначена в нашій Угоді користувача та в
          нашому Положенні про обробку і захист персональних даних, і ми
          вимагаємо від них дотримання конфіденційності.
        </p>
        <br />
        <p>
          Загальна інформація стосується таких аспектів, як кількість
          відвідувачів Он-лайн платформи, на які сторінки вони заходять, яку
          інформацію завантажують, тип веб-браузера та операційна система, яку
          вони використовують, назва провайдера інтернет-послуг, тощо. Коли Ви
          заходите на нашу Он-лайн платформу, ми автоматично отримуємо цю
          інформацію та узагальнюємо з подібними даними про інших відвідувачів.
          Збираючи таку інформацію, ми аналізуємо, як краще пристосувати нашу
          Он-лайн платформу до потреб відвідувачів.
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Розголошення та передача даних
        </h3>
        <p>
          Інформація про умови розкриття інформації про персональні дані третім
          особам міститься в Положенні.
        </p>

        <h3 className="heading-3 margin-top-50 position__center">
          Оновлення цієї Угоди
        </h3>
        <p>
          Коли ви робите замовлення, берете участь в акції, дослідженнях або
          іншим чином взаємодієте з нами, ви погоджуєтесь з умовами Угоди
          користувача та Положення.
        </p>
        <br />
        <p>
          Ми можемо в односторонньому порядку змінювати або оновлювати частини
          цієї Угоди в будь-який час, без попереднього повідомлення. Будь-ласка,
          час від часу переглядайте Угоду користувача, щоб знати про її зміни та
          оновлення. Усі зміни до цієї Угоди користувача набувають чинності з
          моменту їх публікації. У випадку визнання недійсною або нездійсненною
          будь-якої частини даної Угоди користувача, інші її частини будуть
          залишатися чинними.
        </p>
      </div>
    </div>
  </div>
);
